app/controllers/file_attachments_controller.rb

SELECT "file_attachments".* FROM "file_attachments"
---
  def index
    @file_attachments = FileAttachment.all

SELECT "file_attachments".* FROM "file_attachments" WHERE "file_attachments"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @file_attachment = FileAttachment.find(params[:id])

INSERT INTO "file_attachments" ("created_at", "desc", "note_id", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Thu, 26 Apr 2012 16:07:47 UTC +00:00], ["desc", "lolos"], ["note_id", nil], ["title", "lolo"], ["updated_at", Thu, 26 Apr 2012 16:07:47 UTC +00:00]]
---
  def create
    @file_attachment = FileAttachment.new(params[:file_attachment])
    #@file_attachment.note_id = params[:note_id]
    #print "aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa"
    print params
    respond_to do |format|
      if @file_attachment.save

SELECT "file_attachments".* FROM "file_attachments" WHERE "file_attachments"."id" = ? LIMIT 1  [["id", "13"]]
DELETE FROM "file_attachments" WHERE "file_attachments"."id" = ?  [["id", 13]]
---
  def destroy
    @file_attachment = FileAttachment.find(params[:id])
    @file_attachment.destroy