app/controllers/notes_controller.rb

  def create
    @note = Note.new(params[:note])

    respond_to do |format|
      if @note.save
---
INSERT INTO "notes" ("created_at", "desc", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Thu, 26 Apr 2012 15:49:36 UTC +00:00], ["desc", "2"], ["title", "1"], ["updated_at", Thu, 26 Apr 2012 15:49:36 UTC +00:00]]